[AdventPurifierArmor X2ArmorTemplate]
FriendlyName="ADVENT Purifier Armor"
FriendlyNamePlural="ADVENT Purifier Armors"
BriefSummary="The Purifier suit is perhaps the most heavily constructed piece of armor that we have recovered from ADVENT. Its thick plates combined with a layer of insulation grant complete immunity to heat, fire, acid, and poison. Moreover, just like the ADVENT Captain, Purifiers are able to equip a grenade in an internal compartment. However, there's a setback to equipping such a heavy suit of armor. Its increase in heft and storage capacity negatively affect mobility."
TacticalText="<Bullet/>The Purifier suit is perhaps the most heavily constructed piece of armor that we have recovered from ADVENT. Its thick plates combined with a layer of insulation grant complete immunity to heat, fire, acid, and poison. Moreover, just like the ADVENT Captain, Purifiers are able to equip a grenade in an internal compartment. However, there's a setback to equipping such a heavy suit of armor. Its increase in heft and storage capacity negatively affect mobility."


[AdventPurifierArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="Deception"
LocLongDescription="ADVENT will be less likely to detect this soldier during initial contact."
LocHelpText="ADVENT will be less likely to detect this soldier during initial contact."
LocFlyOverText="ADVENT will be less likely to detect this soldier during initial contact."
LocPromotionPopupText="<Bullet/> ADVENT will be less likely to detect this soldier during initial contact."


[AdventPurifierArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="Protective Insulation"
LocLongDescription="The ADVENT Purifier's armor offers resistances to a variety of elements and additional utility slot at the expense of mobility."
LocHelpText="The ADVENT Purifier's armor offers resistances to a variety of elements and additional utility slot at the expense of mobility"
LocFlyOverText="The ADVENT Purifier's armor offers resistances to a variety of elements and additional utility slot at the expense of mobility"
LocPromotionPopupText="<Bullet/> The ADVENT Purifier's armor offers resistances to a variety of elements and additional utility slot at the expense of mobility"
